<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>Pr&eacute;face</title><link rel="stylesheet" href="../shared/css/html.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.65.1"><link rel="home" href="index.html" title="Hibernate Shards"><link rel="up" href="index.html" title="Hibernate Shards"><link rel="previous" href="index.html" title="Hibernate Shards"><link rel="next" href="shards-architecture.html" title="Chapitre&nbsp;1.&nbsp;Architecture"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Pr&eacute;face</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="index.html">Pr&eacute;c&eacute;dent</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="shards-architecture.html">Suivant</a></td></tr></table><hr></div><div class="preface" lang="fr"><div class="titlepage"><div><div><h2 class="title"><a name="preface"></a>Pr&eacute;face</h2></div></div><div></div></div><p>Traducteur(s) : Vincent Ricard</p><p>
            Vous ne pouvez pas toujours mettre vos donn&eacute;es relationnelles dans une
            seule base de donn&eacute;es relationnelle. Parfois vous avez simplement trop
            de donn&eacute;es. Parfois vous avez une architecture de d&eacute;ploiement r&eacute;partie
            (la latence r&eacute;seau entre la Californie et l'Inde peut &ecirc;tre trop grande
            pour avoir une seule base de donn&eacute;es). Il peut m&ecirc;me y avoir des raisons
            non techniques (un client potentiel ne traitera simplement pas &agrave; moins
            que les donn&eacute;es de sa compagnie soient dans sa propre instance de base).
            Quelques soient vos raisons, parler de plusieurs bases de donn&eacute;es
            relationnelles complique in&eacute;vitablement le d&eacute;veloppement de votre
            application. Hibernate Shards est un framework qui est con&ccedil;u pour
            encapsuler et minimiser cette complexit&eacute; en ajoutant la prise en charge du
            <a href="http://en.wikipedia.org/w/index.php?title=Partition_%28database%29&amp;oldid=99996308" target="_top">partitionnement horizontal</a> au dessus d'Hibernate Core. Nous
            avons simplement pour but de founir une vue unifi&eacute;e de plusieurs bases
            de donn&eacute;es via Hibernate.
        </p><p>
            Qu'est donc un "shard" (NdT : fragment) ? Bonne question. "Shard" est juste un autre
            mot pour "segment" ou "partition", mais c'est le terme choisi par
            Google. Hibernate Shards &eacute;tait &agrave; l'origine le
            <a href="http://www.google.com/support/jobs/bin/static.py?page=about.html" target="_top">projet de 20 pourcents</a>
            d'une petite &eacute;quipe d'ing&eacute;nieurs Google, donc la nomenclature du projet
            tournait autour des fragments depuis le d&eacute;but. Nous ouvrons les sources
            que nous avons jusqu'ici parce que nous voulons que la communaut&eacute;
            Hibernate puisse b&eacute;n&eacute;ficier de nos efforts d&egrave;s que possible, mais aussi
            avec l'espoir et le d&eacute;sir que cette communaut&eacute; puisse nous aider &agrave;
            atteindre une version GA plus rapidement que si nous gardions pour nous.
            Nous nous attendons tout &agrave; fait &agrave; trouver des d&eacute;fauts dans notre
            conception et notre impl&eacute;mentation, et nous appr&eacute;cions votre patience
            pendant que nous travaillons &agrave; les corriger.
        </p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="index.html">Pr&eacute;c&eacute;dent</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="index.html">Niveau sup&eacute;rieur</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="shards-architecture.html">Suivant</a></td></tr><tr><td width="40%" align="left" valign="top">Hibernate Shards&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">Sommaire</a></td><td width="40%" align="right" valign="top">&nbsp;Chapitre&nbsp;1.&nbsp;Architecture</td></tr></table></div></body></html>